app/controllers/authentication_controller.rb

  def authenticate
    user = User.find_by(email: params[:email].to_s.downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ash@email.com"], ["LIMIT", 1]]